app/views/admin/items/index.html.erb

    </tr>
    <% Item.all.each do | item | %>
---
SELECT "items".* FROM "items"