app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
      <label>ジャンル</label><br />
      <%= item.select :genre_id, Genre.all.map{|genre|[genre.name, genre.id]}.to_h , prompt:'--選択してください--' ,class: "field" %><br />