app/controllers/admin/items_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items"
---
	def index
		if params[:id].nil? then
			# ジャンルIDが指定されていない場合
			items = Item.where(selling_status: true)
		else
			# ジャンル指定ありの場合
			# 該当ジャンルオブジェクト取得
			genre = Genre.find( params[:id] )
			# ジャンル表示は有効か否か？
			items = ( genre.is_displayed ? genre.items : nil )
			# 有効(true) なら、対象ジャンル商品情報取得
		end
			@pages = items.all.page(params[:page]).reverse_order

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
	def show
		# 閲覧したい商品の情報を取得
		@item = Item.find( params[:id] )

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "items" SET "introduction" = ?, "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["introduction", "これは表示されないやつです?"], ["image_id", "aa24ab66b19e2e0ede3bf8c2e1800066224b9fce533acdf102332da65985"], ["updated_at", "2020-02-26 07:50:09.736852"], ["id", 8]]
---
	def update
		item = Item.find(params[:id])
		item.update( item_params )