app/controllers/admin/orders_controller.rb

	def index
		logger.debug "ここみろ"
		logger.debug params.inspect
		if !!end_user_params then
			# 会員詳細ページからアクセスされた場合
			# 会員IDから該当エンドユーザを検索
			end_user = EndUser.find( end_user_params[:id] )
			# 会員情報から注文履歴をピックアップ
			@orders = end_user.orders
			# タイトル情報作成
			@info = "#{end_user.last_name} #{end_user.first_name}様の注文履歴（全#{@orders.count}件）"
		elsif !!admin_user_params then
			# 本日の注文を確認したい場合
			# 今日の日付を取得
			t = Time.zone.now.to_date
			# 今日の日付の注文情報を取得
			# where.notで明日以降の日付のものを除去（ありえないけど）
			@orders = Order.where( ' created_at > ? ', t  ).where.not( ' created_at > ? ', (t+1.day) )
			# タイトル情報作成
			@info = "本日の注文件数 #{@orders.count}件"
			# logger.debug "Time.zone.now.to_date= ##{t.inspect}"
		else
			# 全注文データの取得
			@orders = Order.all
			# タイトル情報作成
			@info = "全注文履歴一覧（全#{@orders.count}件）"
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "orders" WHERE ( created_at > '2020-02-27' ) AND NOT ( created_at > '2020-02-28' )
SELECT COUNT(*) FROM "orders"

	def show
		# 詳細を確認したい注文データの取得
		@order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def update_order_status
		# 更新するデータをピックアップ
		order = Order.find( params[:id] )
		# 更新処理
		order.update( order_status_params )
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 3], ["updated_at", "2020-02-26 09:27:10.618590"], ["id", 1]]

	def update_making_status
		# 更新するデータをピックアップ
		order_detail = OrderDetail.find( params[:id] )
		# 更新処理
		order_detail.update( making_status_params )
		# 注文詳細ページへ戻る
		redirect_to admin_order_path( order_detail.order )
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 3], ["updated_at", "2020-02-26 09:58:19.080012"], ["id", 2]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]