app/controllers/admin/orders_controller.rb

	def update_order_status
		# 更新するデータをピックアップ
		order = Order.find( params[:id] )
		# 更新処理
		order.update( order_status_params )
---
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 3], ["updated_at", "2020-02-26 09:27:10.618590"], ["id", 1]]

	def update_making_status
		# 更新するデータをピックアップ
		order_detail = OrderDetail.find( params[:id] )
		# 更新処理
		order_detail.update( making_status_params )
		# 注文詳細ページへ戻る
		redirect_to admin_order_path( order_detail.order )
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 3], ["updated_at", "2020-02-26 09:58:19.080012"], ["id", 2]]
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]