app/views/admin/orders/index.html.erb

		<td><%= order.end_user.last_name + order.end_user.first_name %></td>
		<td><%= order.order_details.map{ | order_detail | order_detail.amount }.sum %></td>
---
SELECT "orders".* FROM "orders" WHERE ( created_at > '2020-02-27' ) AND NOT ( created_at > '2020-02-28' )
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]