app/views/admin/orders/show.html.erb

  </tr>
  <% @order.order_details.each do | order_detail | %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]