app/views/orders/new.html.erb

  <label><%= f.radio_button :postage, -2 %>登録済住所から選択</label><br>
  <%= f.select :total_price, create_selection( current_end_user.addresses ) %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 1]]
SELECT COUNT(*) FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 1]]