app/helpers/items_helper.rb

SELECT "genres".* FROM "genres"
---
  def create_selection_genre()
    # Hashオブジェクトの作成
    dic = Hash.new
    # Genresテーブルに登録されている全てを登録
    Genre.all.each do | genre |