app/helpers/orders_helper.rb

    def regulate_order_format( order )
      # -1 => 自分宛, -2 => 配送先一覧から, -3 => 新しいお届け先
      case order.postage
      when -1 then
        # 自分宛
        # 配送先情報の更新
        order = input_confirm_data( order, current_end_user.postal_code, current_end_user.address, current_end_user.last_name + ' ' + current_end_user.first_name )
      when -2 then
        # 配送先一覧から
        #order.total_priceには希望配送先のaddress_idが格納されている
        address = Address.find( order.total_price )
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]