app/views/homes/top.html.erb

        <tr>
          <td>EndUser.first.created_at</td>
          <td><%= EndUser.first.created_at %></td>
          <td><%= EndUser.first.created_at.class %></td>
          <td><%= EndUser.first.created_at.to_date %></td>
---
SELECT  "end_users".* FROM "end_users" ORDER BY "end_users"."id" ASC LIMIT ?  [["LIMIT", 1]]

      <% end %>
      商品登録件数（全<%= Item.count %>件）<br>
      Items#show => 商品詳細ページ
      <% Item.all.each do |item| %><%= link_to ( " %02d" % item.id ), item_path(item.id) %><% end %>
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"

      <% end %>
      アカウント登録数（全<%= EndUser.count %>ユーザ）<br>
      admin/EndUsers#show => 会員詳細ページ
      <% EndUser.all.each do |end_user| %><%= link_to ( " %02d" % end_user.id ), admin_end_user_path(end_user.id) %><% end %>
---
SELECT "end_users".* FROM "end_users"
SELECT COUNT(*) FROM "end_users"