app/controllers/addresses_controller.rb

  def create
    # 編集する配送先を検索
    address = Address.new( address_params )
    # ユーザの関連付け
    address.end_user_id = current_end_user.id
    # 新規配送先情報保存
    address.save
---
INSERT INTO "addresses" ("end_user_id", "postal_code", "ship_to", "consignee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["end_user_id", 1], ["postal_code", "1234567"], ["ship_to", "test"], ["consignee", "example_user"], ["created_at", "2020-02-26 08:29:45.102498"], ["updated_at", "2020-02-26 08:29:45.102498"]]