app/controllers/cart_items_controller.rb

  def create
    # カートに入れるアイテムの情報取得
    cart_item = CartItem.new( cart_item_params )
    # アイテムを入れたユーザの関連付け
    cart_item.end_user_id = current_end_user.id
    # カートへアイテム保存
    cart_item.save
---
INSERT INTO "cart_items" ("end_user_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 1], ["item_id", 7], ["amount", 8], ["created_at", "2020-02-26 08:30:24.241177"], ["updated_at", "2020-02-26 08:30:24.241177"]]

  def index
    # ログインユーザの全カートアイテム情報を取得
    @cart_items = current_end_user.cart_items
    # 先に商品合計額を算出
    @total_price = @cart_items.map{ | cart_item | subtotal( cart_item.item.listed_price, cart_item.amount, false ) }.sum
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 1]]

  def update
    # 更新するカートアイテム情報を取得
    cart_item = CartItem.find( params[:id] )
    # 更新処理
    cart_item.update( cart_item_params )
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 5], ["updated_at", "2020-02-27 00:27:54.763922"], ["id", 21]]