app/controllers/end_users_controller.rb

  def edit
    @end_user = EndUser.find( current_user.id )
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    end_user = EndUser.find( current_user.id )
    end_user.update( end_user_params )
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "end_users" SET "address" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["address", "東京都kana?"], ["updated_at", "2020-02-26 08:29:24.509800"], ["id", 1]]

  def show
    @end_user = EndUser.find( current_user.id )
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]