app/controllers/items_controller.rb

	def index
		# ジャンル表示OKのやつを全部取得
		@genres = Genre.where( is_displayed: true)
		# ジャンルIDが指定されているかで分岐処理
		if !genre_params then
			# ジャンルIDが指定されていない場合
			# ジャンル表示OKのやつを全部取得
			genres = @genres.map{ | g | g.id }
			# ジャンル表示OKの商品を全部取得
			items = Item.where( genre_id: genres)
			# indexページタイトル情報
			@info = '商品'
		else
			# ジャンル指定ありの場合
			# 該当ジャンルオブジェクト取得
			genre = Genre.find( genre_params[:id] )
			# ジャンル表示は有効か否か？
			items = ( genre.is_displayed ? genre.items : nil ) # 有効(true) なら、対象ジャンル商品情報取得
			# indexページタイトル情報
			@info = genre.name
		end
			@pages = items.page(params[:page]).reverse_order
---
SELECT "genres".* FROM "genres" WHERE "genres"."is_displayed" = ?  [["is_displayed", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

	def show
		# 閲覧したい商品の情報を取得
		@item = Item.find( params[:id] )
		# ログインユーザか判定？
		if end_user_signed_in? then
			# 既にカートに入っているアイテムを取得 => nilの可能性もある
			@cart_item = current_end_user.cart_items.find_by( item_id: params[:id] )
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["end_user_id", 1], ["item_id", 7], ["LIMIT", 1]]