app/controllers/orders_controller.rb

SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 1]]
---
  def new
    # 商品がカートに入っているか確認
    if current_end_user.cart_items.count == 0 then

INSERT INTO "orders" ("end_user_id", "postal_code", "ship_to", "consignee", "payment", "postage", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "amount", "purchased_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 1], ["item_id", 1], ["amount", 2], ["purchased_price", 1100], ["created_at", "2020-02-26 08:30:13.275392"], ["updated_at", "2020-02-26 08:30:13.275392"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def create
    # orderテーブルの全てのカラム情報を取得
    order = Order.new( cart_item_params )
    # ユーザの関連付け
    order.end_user_id = current_end_user.id
    # 注文履歴の登録
    order.save
    # OrderDetailテーブルに購入商品の情報を追加する処理
    gets_purchasing_information( current_end_user.cart_items ).each do | order_detail |
      # order_idの格納
      order_detail.order_id = order.id
      # OrderDetailテーブルに登録
      order_detail.save
    end
    # ログインユーザのかカートアイテムを全部削除
    current_end_user.cart_items.destroy_all

SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 2]]
---
  def index
    # ログインユーザのカートアイテムを全部取得
    @orders = current_end_user.orders